app/controllers/home_controller.rb

SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 ORDER BY `products`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
UPDATE `offers` SET response = 'expired' WHERE (ip = '127.0.0.1' AND token = '+Li2PhTrvGvegAd/fd6M1ltE0LOc6mByPJQcgS2L3B4=' AND response in ('counter','last','share'))
---
  def index
    if logged_in?
      if current_user.profile.nil?
        render :template => "users/profile"
      elsif current_user.products.size <= 0
        render :template => "products/product_catalog"
      else
        @notifications = [["profile", current_user.profile.created_at], ["prices", current_user.products.last.created_at]]
        @notifications.sort!{|n1, n2| n2[1] <=> n1[1]}
        render :template => "home/notifications"
      end
    end
    @products = Product.all#(:include => :offers)
    offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))
    ip = request.remote_ip

    Offer.update_all(["response = ?","expired"],["ip = ? AND token = ? AND response in (?)",ip,offer_token,Product::RESPONSES])