app/controllers/products_controller.rb

   def product_catalog
    if request.post?
      @product = Product.new(params[:product])
      @product.user = current_user
      @product.quantity = params[:product][:quantity].gsub(/\D+/, "") if params[:product][:quantity]
      @product.regular_price = params[:product][:regular_price].gsub(/\D+/, "")
      @product.target_price = params[:product][:target_price].gsub(/\D+/, "")
      if @product.save
---
INSERT INTO `products` (`author`, `created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `name`, `product_type`, `quantity`, `regular_price`, `target_price`, `updated_at`, `user_id`) VALUES (NULL, '2012-07-16 06:17:28', '2 Peak Orchestra Tickets', 'image/jpeg', 'offer-01.jpg', 182355, '2012-07-16 06:17:28', '2 Peak Orchestra Tickets', NULL, NULL, 130.0, 112.0, '2012-07-16 06:17:28', 1)

  def make_payment
     if request.post?

      @product = Product.find_by_id(params[:id])


      @today = Time.now.in_time_zone("Eastern Time (US & Canada)").to_datetime

      offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))
      ip = request.remote_ip
      @offer = @product.last_offer(ip,offer_token)
      unless @offer
        @offer = Offer.create(:product_id => @product.id,:price => @product.regular_price,:response => "counter", :token => offer_token, :ip => ip,:counter => 1)
      end

      if @offer.nil?
        redirect_to root_path
        return
      end
      session[@offer.id] = @offer.product.regular_price if session[@offer.id].nil?
      @month = Date.today.month
       @payment = Payment.find_or_initialize_by_offer_id(@offer.id)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `offers` (`counter`, `created_at`, `ip`, `price`, `product_id`, `response`, `token`, `updated_at`) VALUES (1, '2012-07-16 07:02:12', '172.18.100.97', 130.0, 1, 'counter', 'GXgDKA1kbmkAStZTJQhbGJUVDzE1rNnZbWGT0fDeByw=', '2012-07-16 07:02:12')
SELECT `offers`.* FROM `offers` WHERE (product_id = 1 AND response in ('counter','last','share') AND ip = '127.0.0.1' AND token = 'OwDSN0sJNYluASDgvQuiYBFBgimObQFEthHDYzr4HYM=') ORDER BY `offers`.`id` DESC LIMIT 1
SELECT `payments`.* FROM `payments` WHERE `payments`.`offer_id` = 2 LIMIT 1

  def payments
    @payment = Payment.find(params[:id])
    @product = @payment.offer.product
    @month = Date.today.month
    @payment.cc_expiry_year = Date.today.year
    if @payment.nil?
      redirect_to root_path
      return
    end
    if request.post?
      @payment.attributes = params[:payment]
      @payment.cc_expiry_month = (@payment.cc_expiry_year == Date.today.year) ? @payment.cc_expiry_m1 : @payment.cc_expiry_m2

      @payment.price = (@payment.price)
      if @payment.valid? and @payment.validate_card
        success,msg = @payment.purchase(@payment.price)
        if success
          if Rails.env == "development"
            recipients = ADMINS
          else
            recipients = @payment.email
          end
          # Notification.deliver_payment_mail_to_consumer(recipients, @payment)
          # Notification.deliver_payment_mail_to_merchant(ADMINS, @payment)
          flash[:notice] = "Payment saved."
          @payment.offer.update_attributes(:response => "paid")
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1
UPDATE `offers` SET `response` = 'paid', `updated_at` = '2012-07-16 06:35:15' WHERE `offers`.`id` = 2
UPDATE `payments` SET `cc_expiry_year` = 2017, `first_name` = 'Brijesh', `last_name` = 'Shah', `email` = 'brijeshshah86@gmail.com', `card_type` = 'master', `card_number` = 5462828274362385, `postal_code` = '9401', `country` = 'US', `cc_expiry_month` = 7, `transaction_id` = '1KA77288BW387262P', `status` = 1, `updated_at` = '2012-07-16 06:35:15' WHERE `payments`.`id` = 1

  def success
    @payment = Payment.find(params[:id])
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1

  def capsule
    @product = Product.find_by_id(params[:id].to_i)
    redirect_to root_path and return if @product.nil?
    @today = Time.now.in_time_zone("Eastern Time (US & Canada)").to_datetime
    offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))
    ip = request.remote_ip

    if request.post?
      if params[:submit_button] == "no"
        last_offer = @product.last_offer(ip,offer_token)
        response =  Product::RESPONSES.shuffle.first
        if last_offer.nil?
          discount = (@product.regular_price * (rand(20) + 1)) / 100
          new_offer = @product.regular_price - discount
          if new_offer <= @product.target_price
            new_offer = @product.target_price
            response = "last"
          end
          if response == "share"
            new_offer = @product.regular_price
          end
          last_offer = Offer.create(:product_id => @product.id,:price => new_offer,:response => response,:token => offer_token, :ip => ip,:counter => 1)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `offers` (`counter`, `created_at`, `ip`, `price`, `product_id`, `response`, `token`, `updated_at`) VALUES (1, '2012-07-16 06:25:41', '127.0.0.1', 130.0, 1, 'share', 'OwDSN0sJNYluASDgvQuiYBFBgimObQFEthHDYzr4HYM=', '2012-07-16 06:25:41')

            last_offer.counter += 1
            last_offer.price = new_offer
          end
          last_offer.save
---
UPDATE `offers` SET `response` = 'last', `counter` = 2, `price` = 112.0, `updated_at` = '2012-07-16 07:02:51' WHERE `offers`.`id` = 5

  def share_product
    @product = Product.find(params[:id])
    offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))
    ip = request.remote_ip
     @today = Time.now.in_time_zone("Eastern Time (US & Canada)").to_datetime
    last_offer = @product.last_offer(ip,offer_token)
    discount = (last_offer.price * (rand(20) + 1)) / 100
    new_offer = last_offer.price - discount
    last_offer.response = "last"
    if new_offer <= @product.target_price
      new_offer = @product.target_price
    end
    last_offer.price = new_offer
    last_offer.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `offers` SET `response` = 'last', `price` = 127.4, `updated_at` = '2012-07-16 06:25:58' WHERE `offers`.`id` = 2