app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (email = 'biz@dealkat.com' and password='princesthecat') LIMIT 1
---
  def biz
    if logged_in?
      redirect_to root_path
      return
    end
    if params[:user]
      logout_keeping_session!
      @user = User.authenticate(params[:user][:email], params[:user][:password])
      if @user
        @user.update_attribute(:is_blocked, false)
        session[@user.email] = nil

        self.current_user = @user
        new_cookie_flag = (params[:remember_me] == "1")
        handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = nil
      else
        @new_user = User.find_by_email(params[:user][:email])

INSERT INTO `profiles` (`address1`, `address2`, `city`, `created_at`, `name`, `phone`, `state`, `updated_at`, `user_id`, `website`, `zip`) VALUES ('82 Pioneer Way', 'Suite 109', 'Mountain View,', '2012-07-16 06:07:21', 'Dealkat', '4153233506', 'CA', '2012-07-16 06:07:21', 1, 'http://www.dealkat.com', '9401')
---
   def profile
    @profile = current_user.profile if current_user.profile
    if request.post?
      @profile = Profile.new(params[:profile])
      if @profile.valid?
        current_user.profile.destroy if current_user.profile
        @profile.user = current_user
        @profile.save